In [3]:
import pandas as pd

In [4]:
pd.__version__

'2.0.3'

In [5]:
#SERIES EM PANDAS:
# - Similares a arrays unidimensionais do numpy
# - Estruturas similares a "colunas" de dados
# - Arranjos lineares que possuem index, nome, elementos e tipagem

In [6]:
# CRIANDO SERIES A PARTIR DE LISTAS:
s = pd.Series([1.3, 0.2, -3, 0.9, -0.5], name='crescimento')
print(s)
print(s.name)
print(s.dtype)
print(s.values)

0    1.3
1    0.2
2   -3.0
3    0.9
4   -0.5
Name: crescimento, dtype: float64
crescimento
float64
[ 1.3  0.2 -3.   0.9 -0.5]

In [7]:
# - Indice de serie:
print(s.index)
print(s[3])
s[1:3]

RangeIndex(start=0, stop=5, step=1)
0.9

1    0.2
2   -3.0
Name: crescimento, dtype: float64

In [8]:
# CRIACAO DE SERIES A PARTIR DE DICTS:
pop_br_dict = {
    'Sudeste': 8821341,
    'Nordeste': 324325,
    'Sul': 234523,
    'Norte': 1823123,
    'Centro-Oeste': 81234
}

s = pd.Series(pop_br_dict)
s

Sudeste         8821341
Nordeste         324325
Sul              234523
Norte           1823123
Centro-Oeste      81234
dtype: int64

In [9]:
s['Sul']

234523

In [10]:
s['Nordeste':'Norte']

Nordeste     324325
Sul          234523
Norte       1823123
dtype: int64

In [11]:


s.index = range(0,len(s))
s

0    8821341
1     324325
2     234523
3    1823123
4      81234
dtype: int64

In [12]:
s.index = ['SE', 'NE', 'SUL', 'NOR', 'CO']
s

SE     8821341
NE      324325
SUL     234523
NOR    1823123
CO       81234
dtype: int64

In [20]:
#UTILIZAÇÕES DE FUNÇÕES REMANESCENTES DO NUMPY:
soma = s.sum()
multiplicar = s*3
media = s.mean()

print("SOMA=",soma,"\n","MULTIPLICADOS POR 3:\n",multiplicar,"\n","MEDIA=",media)

SOMA= 11284546
 MULTIPLICADOS POR 3:
 SE     26464023
NE       972975
SUL      703569
NOR     5469369
CO       243702
dtype: int64
 MEDIA= 2256909.2

In [33]:
#DATAFRAME = TABELAS
import numpy as np


s = pd.Series(np.random.randint(0, 10, 10))
pd.DataFrame(s, columns=['Coluna 1'])

   Coluna 1
0         2
1         8
2         2
3         1
4         2
5         2
6         2
7         1
8         6
9         0

In [38]:
# DATAFRAME A PARTIR DE UM DICT DE SERIES
s1 = pd.Series(np.random.randint(15,45,15))
s2 = pd.Series(np.random.normal(170,5,15))
s3 = pd.Series(np.random.binomial(n=1, p=0.5, size=15))
s3 = s3.apply(lambda x: 'F' if x==0 else 'M')

df = pd.DataFrame({
    'idade':s1,
    'altura':s2,
    'sexo': s3
})

print(df.columns)
df.head()

Index(['idade', 'altura', 'sexo'], dtype='object')

   idade      altura sexo
0     19  164.889671    F
1     35  167.608956    M
2     19  163.901734    F
3     17  166.862848    F
4     43  166.372757    M

In [39]:
#DATAFRAME A PARTIR DE UMA LISTA DE DICTS:
p1 = {'nome': 'Ana', 'idade':23, 'altura':1.67, 'CPF': 12345}
p2 =  {'nome': 'Pedro', 'idade': 30, 'altura': 1.75, 'CPF': 67890}
p3 =  {'nome': 'Maria', 'idade': 28, 'altura': 1.62, 'CPF': 54321}
p4 =  {'nome': 'João', 'idade': 25, 'altura': 1.80, 'CPF': 98765}
p5 =  {'nome': 'Carla', 'idade': 29, 'altura': 1.70, 'CPF': 23456}
p6 = {'nome': 'Lucas', 'idade': 26, 'altura': 1.76, 'CPF': 34567}

lista = [p1,p2,p3,p4,p5]

pd.DataFrame(lista)

    nome  idade  altura    CPF
0    Ana     23    1.67  12345
1  Pedro     30    1.75  67890
2  Maria     28    1.62  54321
3   João     25    1.80  98765
4  Carla     29    1.70  23456

In [40]:
# Adição de novas colunas:
peso = np.random.normal(75, 10, 15)
df['peso'] = peso
df.head()

   idade      altura sexo       peso
0     19  164.889671    F  67.453439
1     35  167.608956    M  69.414353
2     19  163.901734    F  96.637949
3     17  166.862848    F  81.740477
4     43  166.372757    M  65.677388

In [45]:
imc = df['peso']/df['altura']
df['imc'] = imc
df.head()

   idade      altura sexo       peso       imc
0     19  164.889671    F  67.453439  0.409082
1     35  167.608956    M  69.414353  0.414145
2     19  163.901734    F  96.637949  0.589609
3     17  166.862848    F  81.740477  0.489866
4     43  166.372757    M  65.677388  0.394760